#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Author        : Rocky Wayne 
# @Created       : 2020-05-02 22:15:12
# @Last Modified : 2020-05-02 22:15:12
# @Mail          : lostlorder@gamil.com
# @Version       : alpha-1.0



# 请实现一个函数用来匹配包含'. '和'*'的正则表达式。模式中的字符'.'表示任意一个字符，而'*'表示它前面的字符可以出现任意次（含0次）。在本题中，匹配
# 是指字符串的所有字符匹配整个模式。例如，字符串"aaa"与模式"a.a"和"ab*ac*a"匹配，但与"aa.a"和"ab*a"均不匹配。
#
#  示例 1:
#
#  输入:
# s = "aa"
# p = "a"
# 输出: false
# 解释: "a" 无法匹配 "aa" 整个字符串。
#
#
#  示例 2:
#
#  输入:
# s = "aa"
# p = "a*"
# 输出: true
# 解释: 因为 '*' 代表可以匹配零个或多个前面的那一个元素, 在这里前面的元素就是 'a'。因此，字符串 "aa" 可被视为 'a' 重复了一次。
#
#
#  示例 3:
#
#  输入:
# s = "ab"
# p = ".*"
# 输出: true
# 解释: ".*" 表示可匹配零个或多个（'*'）任意字符（'.'）。
#
#
#  示例 4:
#
#  输入:
# s = "aab"
# p = "c*a*b"
# 输出: true
# 解释: 因为 '*' 表示零个或多个，这里 'c' 为 0 个, 'a' 被重复一次。因此可以匹配字符串 "aab"。
#
#
#  示例 5:
#
#  输入:
# s = "mississippi"
# p = "mis*is*p*."
# 输出: false
#
#
#  s 可能为空，且只包含从 a-z 的小写字母。
#  p 可能为空，且只包含从 a-z 的小写字母以及字符 . 和 *，无连续的 '*'。
#
#
#  注意：本题与主站 10 题相同：https://leetcode-cn.com/problems/regular-expression-matching/
#
#  Related Topics 动态规划
#  👍 73 👎 0


import pytest


class Solution:

    def isMatch(self, s: str, p: str) -> bool:
        """
        当*出现时，一定会在前面跟一个其他字符，所以一定会出现在pattern[1]的位置。一种情况是我们忽略这对pattern，因为可以出现0次；
        另一种情况是匹配上这个字符，用递归的方式匹配下一个。

         一定  要用f_match = bool(s)，否则结果可能输出''
        """
        if not p:
            return not s
        f_match = bool(s) and p[0] in [s[0], "."]
        if len(p) > 1 and p[1] == "*":
            return self.isMatch(s, p[2:]) or (
                    f_match and self.isMatch(s[1:], p)
            )
        else:
            return f_match and self.isMatch(s[1:], p[1:])


@pytest.mark.parametrize("kwargs,expected", [
    (dict(s="aa", p="a"), False),
    (dict(s="aa", p="a*"), True),
    (dict(s="ab", p=".*"), True),
    (dict(s="aab", p="c*a*b"), True),
    (dict(s="mississippi", p="mis*is*p*."), False),
    (dict(s="ab", p=".*c"), False),
])
def test_solutions(kwargs, expected):
    assert Solution().isMatch(**kwargs) == expected


if __name__ == '__main__':
    pytest.main(["-q", "--color=yes", "--capture=no", __file__])
